; domain
(define (domain driverlog)
  (:requirements :typing :fluents) 
  (:types           location locatable - object
		driver truck obj - locatable)

  (:predicates 
		(at ?obj - locatable ?loc - location)
		(in ?obj1 - obj ?obj - truck)
		(driving ?d - driver ?v - truck)
		(link ?x  - location ?y - location) 
		(path ?x  - location ?y - location)
		(empty ?v - truck)
)
  (:functions 	
		(time-to-drive ?l1 - location ?l2 - location)
		(fuel-used)
		(fuel-per-minute ?t - truck)
		(load ?t - truck)
  )


(:action LOAD-TRUCK
  :parameters
   (?obj - obj
    ?truck - truck
    ?loc - location)
  :precondition
   (and (at ?truck ?loc) (at ?obj ?loc))
  :effect
   (and (not (at ?obj ?loc)) (in ?obj ?truck) (increase (load ?truck) 1)
		(increase (fuel-per-minute ?truck) (+ (load ?truck) 1))))

(:action UNLOAD-TRUCK
  :parameters
   (?obj - obj
    ?truck - truck
    ?loc - location)
  :precondition
   (and (at ?truck ?loc) (in ?obj ?truck))
  :effect
   (and (not (in ?obj ?truck)) (at ?obj ?loc) (decrease (load ?truck) 1)
		(decrease (fuel-per-minute ?truck) (load ?truck))))


(:action BOARD-TRUCK
  :parameters
   (?driver - driver
    ?truck - truck
    ?loc - location)
  :precondition
   (and (at ?truck ?loc) (at ?driver ?loc) (empty ?truck))
  :effect
   (and (not (at ?driver ?loc)) (driving ?driver ?truck) (not (empty ?truck))))

(:action DISEMBARK-TRUCK
  :parameters
   (?driver - driver
    ?truck - truck
    ?loc - location)
  :precondition
   (and (at ?truck ?loc) (driving ?driver ?truck))
  :effect
   (and (not (driving ?driver ?truck)) (at ?driver ?loc) (empty ?truck)))

(:action DRIVE-TRUCK
  :parameters
   (?truck - truck
    ?loc-from - location
    ?loc-to - location
    ?driver - driver)
  :precondition
   (and (at ?truck ?loc-from)
   (driving ?driver ?truck) (link ?loc-from ?loc-to))
  :effect
   (and (not (at ?truck ?loc-from)) (at ?truck ?loc-to)
		(increase (fuel-used) (* (fuel-per-minute ?truck) (time-to-drive ?loc-from ?loc-to)))))

(:action WALK
  :parameters
   (?driver - driver
    ?loc-from - location
    ?loc-to - location)
  :precondition
   (and (at ?driver ?loc-from) (path ?loc-from ?loc-to))
  :effect
   (and (not (at ?driver ?loc-from)) (at ?driver ?loc-to)))

 
)

; problem
(define (problem DLOG-3-8-4)
	(:domain driverlog)
	(:objects
	driver1 - driver
	driver2 - driver
	driver3 - driver
	truck1 - truck
	truck2 - truck
	truck3 - truck
	truck4 - truck
	truck5 - truck
	truck6 - truck
	truck7 - truck
	truck8 - truck
	package1 - obj
	package2 - obj
	package3 - obj
	package4 - obj
	s0 - location
	s1 - location
	s2 - location
	s3 - location
	s4 - location
	s5 - location
	s6 - location
	s7 - location
	s8 - location
	p0-1 - location
	p0-2 - location
	p1-8 - location
	p2-4 - location
	p2-6 - location
	p4-0 - location
	p4-5 - location
	p5-0 - location
	p5-8 - location
	p7-0 - location
	p7-3 - location
	p7-5 - location
	p7-8 - location
	p8-0 - location
	p8-4 - location
	)
	(:init
	(at driver1 s8)
	(at driver2 s7)
	(at driver3 s6)
	(at truck1 s4)
	(empty truck1)
	(= (load truck1) 0)
	(= (fuel-per-minute truck1) 10)
	(at truck2 s1)
	(empty truck2)
	(= (load truck2) 0)
	(= (fuel-per-minute truck2) 10)
	(at truck3 s8)
	(empty truck3)
	(= (load truck3) 0)
	(= (fuel-per-minute truck3) 10)
	(at truck4 s0)
	(empty truck4)
	(= (load truck4) 0)
	(= (fuel-per-minute truck4) 10)
	(at truck5 s2)
	(empty truck5)
	(= (load truck5) 0)
	(= (fuel-per-minute truck5) 10)
	(at truck6 s2)
	(empty truck6)
	(= (load truck6) 0)
	(= (fuel-per-minute truck6) 10)
	(at truck7 s5)
	(empty truck7)
	(= (load truck7) 0)
	(= (fuel-per-minute truck7) 10)
	(at truck8 s1)
	(empty truck8)
	(= (load truck8) 0)
	(= (fuel-per-minute truck8) 10)
	(at package1 s8)
	(at package2 s6)
	(at package3 s0)
	(at package4 s8)
	(path s0 p0-1)
	(path p0-1 s0)
	(path s1 p0-1)
	(path p0-1 s1)
	(path s0 p0-2)
	(path p0-2 s0)
	(path s2 p0-2)
	(path p0-2 s2)
	(path s1 p1-8)
	(path p1-8 s1)
	(path s8 p1-8)
	(path p1-8 s8)
	(path s2 p2-4)
	(path p2-4 s2)
	(path s4 p2-4)
	(path p2-4 s4)
	(path s2 p2-6)
	(path p2-6 s2)
	(path s6 p2-6)
	(path p2-6 s6)
	(path s4 p4-0)
	(path p4-0 s4)
	(path s0 p4-0)
	(path p4-0 s0)
	(path s4 p4-5)
	(path p4-5 s4)
	(path s5 p4-5)
	(path p4-5 s5)
	(path s5 p5-0)
	(path p5-0 s5)
	(path s0 p5-0)
	(path p5-0 s0)
	(path s5 p5-8)
	(path p5-8 s5)
	(path s8 p5-8)
	(path p5-8 s8)
	(path s7 p7-0)
	(path p7-0 s7)
	(path s0 p7-0)
	(path p7-0 s0)
	(path s7 p7-3)
	(path p7-3 s7)
	(path s3 p7-3)
	(path p7-3 s3)
	(path s7 p7-5)
	(path p7-5 s7)
	(path s5 p7-5)
	(path p7-5 s5)
	(path s7 p7-8)
	(path p7-8 s7)
	(path s8 p7-8)
	(path p7-8 s8)
	(path s8 p8-0)
	(path p8-0 s8)
	(path s0 p8-0)
	(path p8-0 s0)
	(path s8 p8-4)
	(path p8-4 s8)
	(path s4 p8-4)
	(path p8-4 s4)
	(link s0 s1)
	(link s1 s0)
	(= (time-to-drive s0 s1) 36)
	(= (time-to-drive s1 s0) 36)
	(link s1 s2)
	(link s2 s1)
	(= (time-to-drive s1 s2) 76)
	(= (time-to-drive s2 s1) 76)
	(link s2 s3)
	(link s3 s2)
	(= (time-to-drive s2 s3) 35)
	(= (time-to-drive s3 s2) 35)
	(link s2 s4)
	(link s4 s2)
	(= (time-to-drive s2 s4) 46)
	(= (time-to-drive s4 s2) 46)
	(link s2 s7)
	(link s7 s2)
	(= (time-to-drive s2 s7) 80)
	(= (time-to-drive s7 s2) 80)
	(link s2 s8)
	(link s8 s2)
	(= (time-to-drive s2 s8) 79)
	(= (time-to-drive s8 s2) 79)
	(link s3 s0)
	(link s0 s3)
	(= (time-to-drive s3 s0) 11)
	(= (time-to-drive s0 s3) 11)
	(link s3 s1)
	(link s1 s3)
	(= (time-to-drive s3 s1) 20)
	(= (time-to-drive s1 s3) 20)
	(link s4 s0)
	(link s0 s4)
	(= (time-to-drive s4 s0) 46)
	(= (time-to-drive s0 s4) 46)
	(link s4 s5)
	(link s5 s4)
	(= (time-to-drive s4 s5) 17)
	(= (time-to-drive s5 s4) 17)
	(link s5 s0)
	(link s0 s5)
	(= (time-to-drive s5 s0) 50)
	(= (time-to-drive s0 s5) 50)
	(link s6 s1)
	(link s1 s6)
	(= (time-to-drive s6 s1) 44)
	(= (time-to-drive s1 s6) 44)
	(link s6 s3)
	(link s3 s6)
	(= (time-to-drive s6 s3) 56)
	(= (time-to-drive s3 s6) 56)
	(link s6 s5)
	(link s5 s6)
	(= (time-to-drive s6 s5) 34)
	(= (time-to-drive s5 s6) 34)
	(link s6 s8)
	(link s8 s6)
	(= (time-to-drive s6 s8) 99)
	(= (time-to-drive s8 s6) 99)
	(link s7 s0)
	(link s0 s7)
	(= (time-to-drive s7 s0) 12)
	(= (time-to-drive s0 s7) 12)
	(link s7 s1)
	(link s1 s7)
	(= (time-to-drive s7 s1) 52)
	(= (time-to-drive s1 s7) 52)
	(link s7 s5)
	(link s5 s7)
	(= (time-to-drive s7 s5) 70)
	(= (time-to-drive s5 s7) 70)
	(link s7 s6)
	(link s6 s7)
	(= (time-to-drive s7 s6) 76)
	(= (time-to-drive s6 s7) 76)
	(link s7 s8)
	(link s8 s7)
	(= (time-to-drive s7 s8) 1)
	(= (time-to-drive s8 s7) 1)
	(link s8 s1)
	(link s1 s8)
	(= (time-to-drive s8 s1) 39)
	(= (time-to-drive s1 s8) 39)
	(link s8 s3)
	(link s3 s8)
	(= (time-to-drive s8 s3) 35)
	(= (time-to-drive s3 s8) 35)
	(link s8 s5)
	(link s5 s8)
	(= (time-to-drive s8 s5) 65)
	(= (time-to-drive s5 s8) 65)
	(= (fuel-used) 0)
)
	(:goal (and
	(at driver1 s8)
	(at driver2 s7)
	(at driver3 s0)
	(at truck1 s2)
	(at truck3 s0)
	(at truck4 s5)
	(at truck5 s3)
	(at truck6 s2)
	(at truck7 s1)
	(at truck8 s0)
	(at package1 s8)
	(at package2 s6)
	(at package3 s2)
	))

(:metric minimize (+ (* 4 (total-time)) (* 3 (fuel-used))))

)

; plan
1. (walk driver3 s6 p2-6)
   deleted: (at driver3 s6)
   added: (at driver3 p2-6)
   goals met: 5 of 13
2. (walk driver3 p2-6 s2)
   deleted: (at driver3 p2-6)
   added: (at driver3 s2)
   goals met: 5 of 13
3. (walk driver3 s2 p0-2)
   deleted: (at driver3 s2)
   added: (at driver3 p0-2)
   goals met: 5 of 13
4. (walk driver3 p0-2 s0)
   deleted: (at driver3 p0-2)
   added: (at driver3 s0)
   goals met: 6 of 13
5. (board-truck driver3 truck4 s0)
   deleted: (at driver3 s0) (empty truck4)
   added: (driving driver3 truck4)
   goals met: 5 of 13
6. (load-truck package3 truck4 s0)
   deleted: (at package3 s0)
   added: (in package3 truck4)
   changed: (load truck4) from 0 to 1, (fuel-per-minute truck4) from 10 to 11
   goals met: 5 of 13
7. (board-truck driver1 truck3 s8)
   deleted: (at driver1 s8) (empty truck3)
   added: (driving driver1 truck3)
   goals met: 4 of 13
8. (drive-truck truck4 s0 s4 driver3)
   deleted: (at truck4 s0)
   added: (at truck4 s4)
   changed: (fuel-used) from 0 to 506
   goals met: 4 of 13
9. (walk driver2 s7 p7-5)
   deleted: (at driver2 s7)
   added: (at driver2 p7-5)
   goals met: 3 of 13
10. (disembark-truck driver1 truck3 s8)
   deleted: (driving driver1 truck3)
   added: (at driver1 s8) (empty truck3)
   goals met: 4 of 13
11. (walk driver2 p7-5 s5)
   deleted: (at driver2 p7-5)
   added: (at driver2 s5)
   goals met: 4 of 13
12. (board-truck driver2 truck7 s5)
   deleted: (at driver2 s5) (empty truck7)
   added: (driving driver2 truck7)
   goals met: 4 of 13
13. (drive-truck truck7 s5 s7 driver2)
   deleted: (at truck7 s5)
   added: (at truck7 s7)
   changed: (fuel-used) from 506 to 1206
   goals met: 4 of 13
14. (drive-truck truck7 s7 s1 driver2)
   deleted: (at truck7 s7)
   added: (at truck7 s1)
   changed: (fuel-used) from 1206 to 1726
   goals met: 5 of 13
15. (disembark-truck driver2 truck7 s1)
   deleted: (driving driver2 truck7)
   added: (at driver2 s1) (empty truck7)
   goals met: 5 of 13
16. (board-truck driver2 truck8 s1)
   deleted: (at driver2 s1) (empty truck8)
   added: (driving driver2 truck8)
   goals met: 5 of 13
17. (drive-truck truck8 s1 s0 driver2)
   deleted: (at truck8 s1)
   added: (at truck8 s0)
   changed: (fuel-used) from 1726 to 2086
   goals met: 6 of 13
18. (board-truck driver1 truck3 s8)
   deleted: (at driver1 s8) (empty truck3)
   added: (driving driver1 truck3)
   goals met: 5 of 13
19. (drive-truck truck3 s8 s1 driver1)
   deleted: (at truck3 s8)
   added: (at truck3 s1)
   changed: (fuel-used) from 2086 to 2476
   goals met: 5 of 13
20. (drive-truck truck3 s1 s0 driver1)
   deleted: (at truck3 s1)
   added: (at truck3 s0)
   changed: (fuel-used) from 2476 to 2836
   goals met: 6 of 13
21. (disembark-truck driver1 truck3 s0)
   deleted: (driving driver1 truck3)
   added: (at driver1 s0) (empty truck3)
   goals met: 6 of 13
22. (walk driver1 s0 p8-0)
   deleted: (at driver1 s0)
   added: (at driver1 p8-0)
   goals met: 6 of 13
23. (walk driver1 p8-0 s8)
   deleted: (at driver1 p8-0)
   added: (at driver1 s8)
   goals met: 7 of 13
24. (drive-truck truck8 s0 s7 driver2)
   deleted: (at truck8 s0)
   added: (at truck8 s7)
   changed: (fuel-used) from 2836 to 2956
   goals met: 6 of 13
25. (drive-truck truck4 s4 s2 driver3)
   deleted: (at truck4 s4)
   added: (at truck4 s2)
   changed: (fuel-used) from 2956 to 3462
   goals met: 6 of 13
26. (unload-truck package3 truck4 s2)
   deleted: (in package3 truck4)
   added: (at package3 s2)
   changed: (load truck4) from 1 to 0, (fuel-per-minute truck4) from 11 to 10
   goals met: 7 of 13
27. (drive-truck truck4 s2 s4 driver3)
   deleted: (at truck4 s2)
   added: (at truck4 s4)
   changed: (fuel-used) from 3462 to 3922
   goals met: 7 of 13
28. (disembark-truck driver3 truck4 s4)
   deleted: (driving driver3 truck4)
   added: (at driver3 s4) (empty truck4)
   goals met: 7 of 13
29. (board-truck driver3 truck1 s4)
   deleted: (at driver3 s4) (empty truck1)
   added: (driving driver3 truck1)
   goals met: 7 of 13
30. (drive-truck truck1 s4 s2 driver3)
   deleted: (at truck1 s4)
   added: (at truck1 s2)
   changed: (fuel-used) from 3922 to 4382
   goals met: 8 of 13
31. (disembark-truck driver3 truck1 s2)
   deleted: (driving driver3 truck1)
   added: (at driver3 s2) (empty truck1)
   goals met: 8 of 13
32. (board-truck driver3 truck5 s2)
   deleted: (at driver3 s2) (empty truck5)
   added: (driving driver3 truck5)
   goals met: 8 of 13
33. (drive-truck truck5 s2 s3 driver3)
   deleted: (at truck5 s2)
   added: (at truck5 s3)
   changed: (fuel-used) from 4382 to 4732
   goals met: 9 of 13
34. (drive-truck truck5 s3 s0 driver3)
   deleted: (at truck5 s3)
   added: (at truck5 s0)
   changed: (fuel-used) from 4732 to 4842
   goals met: 8 of 13
35. (disembark-truck driver3 truck5 s0)
   deleted: (driving driver3 truck5)
   added: (at driver3 s0) (empty truck5)
   goals met: 9 of 13
36. (drive-truck truck8 s7 s0 driver2)
   deleted: (at truck8 s7)
   added: (at truck8 s0)
   changed: (fuel-used) from 4842 to 4962
   goals met: 10 of 13
37. (walk driver3 s0 p4-0)
   deleted: (at driver3 s0)
   added: (at driver3 p4-0)
   goals met: 9 of 13
38. (disembark-truck driver2 truck8 s0)
   deleted: (driving driver2 truck8)
   added: (at driver2 s0) (empty truck8)
   goals met: 9 of 13
39. (walk driver2 s0 p7-0)
   deleted: (at driver2 s0)
   added: (at driver2 p7-0)
   goals met: 9 of 13
40. (walk driver2 p7-0 s7)
   deleted: (at driver2 p7-0)
   added: (at driver2 s7)
   goals met: 10 of 13
41. (walk driver3 p4-0 s0)
   deleted: (at driver3 p4-0)
   added: (at driver3 s0)
   goals met: 11 of 13
42. (board-truck driver3 truck5 s0)
   deleted: (at driver3 s0) (empty truck5)
   added: (driving driver3 truck5)
   goals met: 10 of 13
43. (drive-truck truck5 s0 s4 driver3)
   deleted: (at truck5 s0)
   added: (at truck5 s4)
   changed: (fuel-used) from 4962 to 5422
   goals met: 10 of 13
44. (drive-truck truck5 s4 s2 driver3)
   deleted: (at truck5 s4)
   added: (at truck5 s2)
   changed: (fuel-used) from 5422 to 5882
   goals met: 10 of 13
45. (disembark-truck driver3 truck5 s2)
   deleted: (driving driver3 truck5)
   added: (at driver3 s2) (empty truck5)
   goals met: 10 of 13
46. (walk driver3 s2 p0-2)
   deleted: (at driver3 s2)
   added: (at driver3 p0-2)
   goals met: 10 of 13
47. (walk driver3 p0-2 s0)
   deleted: (at driver3 p0-2)
   added: (at driver3 s0)
   goals met: 11 of 13
48. (walk driver3 s0 p4-0)
   deleted: (at driver3 s0)
   added: (at driver3 p4-0)
   goals met: 10 of 13
49. (walk driver3 p4-0 s4)
   deleted: (at driver3 p4-0)
   added: (at driver3 s4)
   goals met: 10 of 13
50. (board-truck driver3 truck4 s4)
   deleted: (at driver3 s4) (empty truck4)
   added: (driving driver3 truck4)
   goals met: 10 of 13
51. (drive-truck truck4 s4 s0 driver3)
   deleted: (at truck4 s4)
   added: (at truck4 s0)
   changed: (fuel-used) from 5882 to 6342
   goals met: 10 of 13
52. (disembark-truck driver3 truck4 s0)
   deleted: (driving driver3 truck4)
   added: (at driver3 s0) (empty truck4)
   goals met: 11 of 13
53. (walk driver3 s0 p0-2)
   deleted: (at driver3 s0)
   added: (at driver3 p0-2)
   goals met: 10 of 13
54. (walk driver3 p0-2 s2)
   deleted: (at driver3 p0-2)
   added: (at driver3 s2)
   goals met: 10 of 13
55. (board-truck driver3 truck5 s2)
   deleted: (at driver3 s2) (empty truck5)
   added: (driving driver3 truck5)
   goals met: 10 of 13
56. (walk driver2 s7 p7-0)
   deleted: (at driver2 s7)
   added: (at driver2 p7-0)
   goals met: 9 of 13
57. (disembark-truck driver3 truck5 s2)
   deleted: (driving driver3 truck5)
   added: (at driver3 s2) (empty truck5)
   goals met: 9 of 13
58. (walk driver3 s2 p0-2)
   deleted: (at driver3 s2)
   added: (at driver3 p0-2)
   goals met: 9 of 13
59. (walk driver2 p7-0 s0)
   deleted: (at driver2 p7-0)
   added: (at driver2 s0)
   goals met: 9 of 13
60. (walk driver3 p0-2 s0)
   deleted: (at driver3 p0-2)
   added: (at driver3 s0)
   goals met: 10 of 13
61. (board-truck driver3 truck4 s0)
   deleted: (at driver3 s0) (empty truck4)
   added: (driving driver3 truck4)
   goals met: 9 of 13
62. (walk driver2 s0 p0-2)
   deleted: (at driver2 s0)
   added: (at driver2 p0-2)
   goals met: 9 of 13
63. (walk driver2 p0-2 s2)
   deleted: (at driver2 p0-2)
   added: (at driver2 s2)
   goals met: 9 of 13
64. (disembark-truck driver3 truck4 s0)
   deleted: (driving driver3 truck4)
   added: (at driver3 s0) (empty truck4)
   goals met: 10 of 13
65. (board-truck driver2 truck6 s2)
   deleted: (at driver2 s2) (empty truck6)
   added: (driving driver2 truck6)
   goals met: 10 of 13
66. (drive-truck truck6 s2 s7 driver2)
   deleted: (at truck6 s2)
   added: (at truck6 s7)
   changed: (fuel-used) from 6342 to 7142
   goals met: 9 of 13
67. (disembark-truck driver2 truck6 s7)
   deleted: (driving driver2 truck6)
   added: (at driver2 s7) (empty truck6)
   goals met: 10 of 13
68. (walk driver3 s0 p0-2)
   deleted: (at driver3 s0)
   added: (at driver3 p0-2)
   goals met: 9 of 13
69. (walk driver3 p0-2 s2)
   deleted: (at driver3 p0-2)
   added: (at driver3 s2)
   goals met: 9 of 13
70. (board-truck driver3 truck5 s2)
   deleted: (at driver3 s2) (empty truck5)
   added: (driving driver3 truck5)
   goals met: 9 of 13
71. (drive-truck truck5 s2 s3 driver3)
   deleted: (at truck5 s2)
   added: (at truck5 s3)
   changed: (fuel-used) from 7142 to 7492
   goals met: 10 of 13
72. (board-truck driver2 truck6 s7)
   deleted: (at driver2 s7) (empty truck6)
   added: (driving driver2 truck6)
   goals met: 9 of 13
73. (drive-truck truck6 s7 s0 driver2)
   deleted: (at truck6 s7)
   added: (at truck6 s0)
   changed: (fuel-used) from 7492 to 7612
   goals met: 9 of 13
74. (drive-truck truck5 s3 s0 driver3)
   deleted: (at truck5 s3)
   added: (at truck5 s0)
   changed: (fuel-used) from 7612 to 7722
   goals met: 8 of 13
75. (drive-truck truck6 s0 s3 driver2)
   deleted: (at truck6 s0)
   added: (at truck6 s3)
   changed: (fuel-used) from 7722 to 7832
   goals met: 8 of 13
76. (disembark-truck driver2 truck6 s3)
   deleted: (driving driver2 truck6)
   added: (at driver2 s3) (empty truck6)
   goals met: 8 of 13
77. (walk driver2 s3 p7-3)
   deleted: (at driver2 s3)
   added: (at driver2 p7-3)
   goals met: 8 of 13
78. (walk driver2 p7-3 s7)
   deleted: (at driver2 p7-3)
   added: (at driver2 s7)
   goals met: 9 of 13
79. (drive-truck truck5 s0 s3 driver3)
   deleted: (at truck5 s0)
   added: (at truck5 s3)
   changed: (fuel-used) from 7832 to 7942
   goals met: 10 of 13
80. (disembark-truck driver3 truck5 s3)
   deleted: (driving driver3 truck5)
   added: (at driver3 s3) (empty truck5)
   goals met: 10 of 13
81. (board-truck driver3 truck6 s3)
   deleted: (at driver3 s3) (empty truck6)
   added: (driving driver3 truck6)
   goals met: 10 of 13
82. (walk driver1 s8 p8-0)
   deleted: (at driver1 s8)
   added: (at driver1 p8-0)
   goals met: 9 of 13
83. (drive-truck truck6 s3 s0 driver3)
   deleted: (at truck6 s3)
   added: (at truck6 s0)
   changed: (fuel-used) from 7942 to 8052
   goals met: 9 of 13
84. (walk driver1 p8-0 s0)
   deleted: (at driver1 p8-0)
   added: (at driver1 s0)
   goals met: 9 of 13
85. (disembark-truck driver3 truck6 s0)
   deleted: (driving driver3 truck6)
   added: (at driver3 s0) (empty truck6)
   goals met: 10 of 13
86. (board-truck driver1 truck6 s0)
   deleted: (at driver1 s0) (empty truck6)
   added: (driving driver1 truck6)
   goals met: 10 of 13
87. (drive-truck truck6 s0 s5 driver1)
   deleted: (at truck6 s0)
   added: (at truck6 s5)
   changed: (fuel-used) from 8052 to 8552
   goals met: 10 of 13
88. (board-truck driver3 truck4 s0)
   deleted: (at driver3 s0) (empty truck4)
   added: (driving driver3 truck4)
   goals met: 9 of 13
89. (drive-truck truck6 s5 s4 driver1)
   deleted: (at truck6 s5)
   added: (at truck6 s4)
   changed: (fuel-used) from 8552 to 8722
   goals met: 9 of 13
90. (disembark-truck driver1 truck6 s4)
   deleted: (driving driver1 truck6)
   added: (at driver1 s4) (empty truck6)
   goals met: 9 of 13
91. (walk driver1 s4 p8-4)
   deleted: (at driver1 s4)
   added: (at driver1 p8-4)
   goals met: 9 of 13
92. (walk driver1 p8-4 s8)
   deleted: (at driver1 p8-4)
   added: (at driver1 s8)
   goals met: 10 of 13
93. (drive-truck truck4 s0 s4 driver3)
   deleted: (at truck4 s0)
   added: (at truck4 s4)
   changed: (fuel-used) from 8722 to 9182
   goals met: 10 of 13
94. (disembark-truck driver3 truck4 s4)
   deleted: (driving driver3 truck4)
   added: (at driver3 s4) (empty truck4)
   goals met: 10 of 13
95. (board-truck driver3 truck6 s4)
   deleted: (at driver3 s4) (empty truck6)
   added: (driving driver3 truck6)
   goals met: 10 of 13
96. (drive-truck truck6 s4 s0 driver3)
   deleted: (at truck6 s4)
   added: (at truck6 s0)
   changed: (fuel-used) from 9182 to 9642
   goals met: 10 of 13
97. (drive-truck truck6 s0 s7 driver3)
   deleted: (at truck6 s0)
   added: (at truck6 s7)
   changed: (fuel-used) from 9642 to 9762
   goals met: 10 of 13
98. (walk driver1 s8 p8-4)
   deleted: (at driver1 s8)
   added: (at driver1 p8-4)
   goals met: 9 of 13
99. (drive-truck truck6 s7 s2 driver3)
   deleted: (at truck6 s7)
   added: (at truck6 s2)
   changed: (fuel-used) from 9762 to 10562
   goals met: 10 of 13
100. (drive-truck truck6 s2 s4 driver3)
   deleted: (at truck6 s2)
   added: (at truck6 s4)
   changed: (fuel-used) from 10562 to 11022
   goals met: 9 of 13
101. (disembark-truck driver3 truck6 s4)
   deleted: (driving driver3 truck6)
   added: (at driver3 s4) (empty truck6)
   goals met: 9 of 13
102. (walk driver3 s4 p4-0)
   deleted: (at driver3 s4)
   added: (at driver3 p4-0)
   goals met: 9 of 13
103. (walk driver3 p4-0 s0)
   deleted: (at driver3 p4-0)
   added: (at driver3 s0)
   goals met: 10 of 13
104. (walk driver1 p8-4 s4)
   deleted: (at driver1 p8-4)
   added: (at driver1 s4)
   goals met: 10 of 13
105. (board-truck driver1 truck6 s4)
   deleted: (at driver1 s4) (empty truck6)
   added: (driving driver1 truck6)
   goals met: 10 of 13
106. (drive-truck truck6 s4 s2 driver1)
   deleted: (at truck6 s4)
   added: (at truck6 s2)
   changed: (fuel-used) from 11022 to 11482
   goals met: 11 of 13
107. (drive-truck truck6 s2 s8 driver1)
   deleted: (at truck6 s2)
   added: (at truck6 s8)
   changed: (fuel-used) from 11482 to 12272
   goals met: 10 of 13
108. (disembark-truck driver1 truck6 s8)
   deleted: (driving driver1 truck6)
   added: (at driver1 s8) (empty truck6)
   goals met: 11 of 13
109. (walk driver1 s8 p8-4)
   deleted: (at driver1 s8)
   added: (at driver1 p8-4)
   goals met: 10 of 13
110. (walk driver1 p8-4 s4)
   deleted: (at driver1 p8-4)
   added: (at driver1 s4)
   goals met: 10 of 13
111. (board-truck driver1 truck4 s4)
   deleted: (at driver1 s4) (empty truck4)
   added: (driving driver1 truck4)
   goals met: 10 of 13
112. (drive-truck truck4 s4 s5 driver1)
   deleted: (at truck4 s4)
   added: (at truck4 s5)
   changed: (fuel-used) from 12272 to 12442
   goals met: 11 of 13
113. (walk driver3 s0 p8-0)
   deleted: (at driver3 s0)
   added: (at driver3 p8-0)
   goals met: 10 of 13
114. (drive-truck truck4 s5 s8 driver1)
   deleted: (at truck4 s5)
   added: (at truck4 s8)
   changed: (fuel-used) from 12442 to 13092
   goals met: 9 of 13
115. (disembark-truck driver1 truck4 s8)
   deleted: (driving driver1 truck4)
   added: (at driver1 s8) (empty truck4)
   goals met: 10 of 13
116. (board-truck driver1 truck6 s8)
   deleted: (at driver1 s8) (empty truck6)
   added: (driving driver1 truck6)
   goals met: 9 of 13
117. (walk driver3 p8-0 s8)
   deleted: (at driver3 p8-0)
   added: (at driver3 s8)
   goals met: 9 of 13
118. (board-truck driver3 truck4 s8)
   deleted: (at driver3 s8) (empty truck4)
   added: (driving driver3 truck4)
   goals met: 9 of 13
119. (drive-truck truck6 s8 s2 driver1)
   deleted: (at truck6 s8)
   added: (at truck6 s2)
   changed: (fuel-used) from 13092 to 13882
   goals met: 10 of 13
120. (disembark-truck driver1 truck6 s2)
   deleted: (driving driver1 truck6)
   added: (at driver1 s2) (empty truck6)
   goals met: 10 of 13
121. (disembark-truck driver3 truck4 s8)
   deleted: (driving driver3 truck4)
   added: (at driver3 s8) (empty truck4)
   goals met: 10 of 13
122. (board-truck driver1 truck1 s2)
   deleted: (at driver1 s2) (empty truck1)
   added: (driving driver1 truck1)
   goals met: 10 of 13
123. (drive-truck truck1 s2 s8 driver1)
   deleted: (at truck1 s2)
   added: (at truck1 s8)
   changed: (fuel-used) from 13882 to 14672
   goals met: 9 of 13
124. (disembark-truck driver1 truck1 s8)
   deleted: (driving driver1 truck1)
   added: (at driver1 s8) (empty truck1)
   goals met: 10 of 13
125. (board-truck driver1 truck4 s8)
   deleted: (at driver1 s8) (empty truck4)
   added: (driving driver1 truck4)
   goals met: 9 of 13
126. (drive-truck truck4 s8 s5 driver1)
   deleted: (at truck4 s8)
   added: (at truck4 s5)
   changed: (fuel-used) from 14672 to 15322
   goals met: 10 of 13
127. (board-truck driver3 truck1 s8)
   deleted: (at driver3 s8) (empty truck1)
   added: (driving driver3 truck1)
   goals met: 10 of 13
128. (disembark-truck driver1 truck4 s5)
   deleted: (driving driver1 truck4)
   added: (at driver1 s5) (empty truck4)
   goals met: 10 of 13
129. (drive-truck truck1 s8 s2 driver3)
   deleted: (at truck1 s8)
   added: (at truck1 s2)
   changed: (fuel-used) from 15322 to 16112
   goals met: 11 of 13
130. (walk driver1 s5 p5-8)
   deleted: (at driver1 s5)
   added: (at driver1 p5-8)
   goals met: 11 of 13
131. (walk driver1 p5-8 s8)
   deleted: (at driver1 p5-8)
   added: (at driver1 s8)
   goals met: 12 of 13
132. (disembark-truck driver3 truck1 s2)
   deleted: (driving driver3 truck1)
   added: (at driver3 s2) (empty truck1)
   goals met: 12 of 13
133. (walk driver3 s2 p0-2)
   deleted: (at driver3 s2)
   added: (at driver3 p0-2)
   goals met: 12 of 13
134. (walk driver3 p0-2 s0)
   deleted: (at driver3 p0-2)
   added: (at driver3 s0)
   goals met: 13 of 13
